**About Book Crossing Dataset**<br>

This dataset has been compiled by Cai-Nicolas Ziegler in 2004, and it comprises of three tables for users, books and ratings. Explicit ratings are expressed on a scale from 1-10 (higher values denoting higher appreciation) and implicit rating is expressed by 0.

Reference: http://www2.informatik.uni-freiburg.de/~cziegler/BX/

**Objective**

This project entails building a Book Recommender System for users based on user-based and item-based collaborative filtering approaches.

#### Execute the below cell to load the datasets

In [1]:
import pandas as pd
import numpy as np
books1 = pd.read_csv("books.csv", sep=";", error_bad_lines=False, encoding="latin-1",nrows=100000)
books1.columns = ['ISBN', 'BookTitle', 'BookAuthor', 'YearOfPublication', 'Publisher', 'ImageUrlS', 'ImageUrlM', 'ImageUrlL']

books2=pd.read_csv("books.csv", sep=";", error_bad_lines=False, encoding="latin-1",skiprows=100000,nrows=100000)
books2.columns = ['ISBN', 'BookTitle', 'BookAuthor', 'YearOfPublication', 'Publisher', 'ImageUrlS', 'ImageUrlM', 'ImageUrlL']

books3=pd.read_csv("books.csv", sep=";", error_bad_lines=False, encoding="latin-1",skiprows=200000,nrows=100000)
books3.columns = ['ISBN', 'BookTitle', 'BookAuthor', 'YearOfPublication', 'Publisher', 'ImageUrlS', 'ImageUrlM', 'ImageUrlL']

b'Skipping line 6452: expected 8 fields, saw 9\nSkipping line 43667: expected 8 fields, saw 10\nSkipping line 51751: expected 8 fields, saw 9\n'
b'Skipping line 92038: expected 8 fields, saw 9\n'
b'Skipping line 104319: expected 8 fields, saw 9\nSkipping line 121768: expected 8 fields, saw 9\nSkipping line 144058: expected 8 fields, saw 9\nSkipping line 150789: expected 8 fields, saw 9\nSkipping line 157128: expected 8 fields, saw 9\n'
b'Skipping line 180189: expected 8 fields, saw 9\nSkipping line 185738: expected 8 fields, saw 9\n'
b'Skipping line 209388: expected 8 fields, saw 9\nSkipping line 220626: expected 8 fields, saw 9\nSkipping line 227933: expected 8 fields, saw 11\nSkipping line 228957: expected 8 fields, saw 10\nSkipping line 245933: expected 8 fields, saw 9\nSkipping line 251296: expected 8 fields, saw 9\nSkipping line 259941: expected 8 fields, saw 9\nSkipping line 261529: expected 8 fields, saw 9\n'
C:\Users\sharan\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2785: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [2]:
#books3.shape
books=pd.concat([books1,books2,books3])

In [3]:
# first we will see the superficial column data

books.head(5)

,ISBN,BookTitle,BookAuthor,YearOfPublication,Publisher,ImageUrlS,ImageUrlM,ImageUrlL
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

1.The column ISBN contains the unique identification details for each book.
2.Second column is BookTitle which gives the unique titles of the book.
3.Third column is the author name.
4.Year of pubication
5.Publisher
6.Columns Image UrlS,M,L the meaning of which is not known.

In [4]:
users = pd.read_csv('users.csv', sep=';', error_bad_lines=False, encoding="latin-1")
users.columns = ['userID', 'Location', 'Age']
users.head()

   userID                            Location   Age
0       1                  nyc, new york, usa   NaN
1       2           stockton, california, usa  18.0
2       3     moscow, yukon territory, russia   NaN
3       4           porto, v.n.gaia, portugal  17.0
4       5  farnborough, hants, united kingdom   NaN

### Check no.of records and features given in each dataset

In [5]:
users.shape

(278858, 3)

In [6]:
books.shape

(271371, 8)

## Exploring books dataset

In [7]:
books.head()

,ISBN,BookTitle,BookAuthor,YearOfPublication,Publisher,ImageUrlS,ImageUrlM,ImageUrlL
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

### Drop last three columns containing image URLs which will not be required for analysis

In [8]:
books=books.iloc[:,0:5]
books.shape

(271371, 5)

In [9]:
books.head()

,ISBN,BookTitle,BookAuthor,YearOfPublication,Publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company

**yearOfPublication**

### Check unique values of yearOfPublication

In [10]:
books.YearOfPublication.unique()

array([2002, 2001, 1991, 1999, 2000, 1993, 1996, 1988, 2004, 1998, 1994,
       2003, 1997, 1983, 1979, 1995, 1982, 1985, 1992, 1986, 1978, 1980,
       1952, 1987, 1990, 1981, 1989, 1984, 0, 1968, 1961, 1958, 1974,
       1976, 1971, 1977, 1975, 1965, 1941, 1970, 1962, 1973, 1972, 1960,
       1966, 1920, 1956, 1959, 1953, 1951, 1942, 1963, 1964, 1969, 1954,
       1950, 1967, 2005, 1957, 1940, 1937, 1955, 1946, 1936, 1930, 2011,
       1925, 1948, 1943, 1947, 1945, 1923, 2020, 1939, 1926, 1938, 2030,
       1911, 1904, 1949, 1932, 1928, 1929, 1927, 1931, 1914, 2050, 1934,
       1910, 1933, 1902, 1924, 1921, 1900, 2038, 2026, 1944, 1917, 1901,
       2010, 1908, 1906, 1935, 1806, 2021, 2012, '1976', '2003', '1999',
       '1994', '1991', '1992', '1996', '1993', '2002', '1975', '1985',
       '1984', '1990', '2001', '1965', '1995', '1986', '1971', '0',
       '1987', '1978', '1983', '1989', '1980', '1969', '1988', '2004',
       '2000', '1982', '1979', '1998', '1997', '1968', '1973', '1970',
       '2006', '1950', '1981', '1977', '1974', '1961', '1972', '1964',
       '1952', '1960', '1967', '1966', '1957', '1940', '1955', '1951',
       '1959', '1931', '1953', '1954', '1956', '1962', '2005', '1930',
       '1963', '1941', '1944', 'DK Publishing Inc', '1943', '1938',
       '1948', '1958', '1900', '1942', '1923', '1920', '1933',
       'Gallimard', '1909', '1946', '1911', '2008', '1378', '2030',
       '1936', '1947', '2011', '1945', '1932', '2020', '1919', '1949',
       '1922', '1897', '1939', '2024', '1376', '1926', '2037', '1901'],
      dtype=object)

As it can be seen from above that there are some incorrect entries in this field. It looks like Publisher names 'DK Publishing Inc' and 'Gallimard' have been incorrectly loaded as yearOfPublication in dataset due to some errors in csv file.


Also some of the entries are strings and same years have been entered as numbers in some places. We will try to fix these things in the coming questions.

### Check the rows having 'DK Publishing Inc' as yearOfPublication

In [11]:
print(books[books.YearOfPublication=='DK Publishing Inc'])

             ISBN                                          BookTitle  \
9549   078946697X  DK Readers: Creating the X-Men, How It All Beg...
21689  0789466953  DK Readers: Creating the X-Men, How Comic Book...

      BookAuthor  YearOfPublication  \
9549        2000  DK Publishing Inc
21689       2000  DK Publishing Inc

                                               Publisher
9549   http://images.amazon.com/images/P/078946697X.0...
21689  http://images.amazon.com/images/P/0789466953.0...

### Drop the rows having `'DK Publishing Inc'` and `'Gallimard'` as `yearOfPublication`

In [12]:
books1=books[books.YearOfPublication != 'DK Publishing Inc']
books=books1[books1.YearOfPublication !='Gallimard']

### Change the datatype of yearOfPublication to 'int'

In [13]:
books['YearOfPublication']=books['YearOfPublication'].apply(pd.to_numeric, errors='coerce')

C:\Users\sharan\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [14]:
books.dtypes

ISBN                 object
BookTitle            object
BookAuthor           object
YearOfPublication     int64
Publisher            object
dtype: object

### Drop NaNs in `'publisher'` column

In [40]:
books=books.dropna(subset=['Publisher'])
books.columns

Index(['ISBN', 'BookTitle', 'BookAuthor', 'YearOfPublication', 'Publisher'], dtype='object')

## Exploring Users dataset

In [16]:
print(users.shape)
users.head()

(278858, 3)

   userID                            Location   Age
0       1                  nyc, new york, usa   NaN
1       2           stockton, california, usa  18.0
2       3     moscow, yukon territory, russia   NaN
3       4           porto, v.n.gaia, portugal  17.0
4       5  farnborough, hants, united kingdom   NaN

### Get all unique values in ascending order for column `Age`

In [17]:
np.unique(np.sort(users['Age'].values))

array([ 0.,  1.,  2., ..., nan, nan, nan])

Age column has some invalid entries like nan, 0 and very high values like 100 and above

### Values below 5 and above 90 do not make much sense for our book rating case...hence replace these by NaNs

Given the book ratings are available in the ratings dataset we are going to import the 'ratings' data.

In [18]:
ratings= pd.read_csv('ratings.csv', sep=';', error_bad_lines=False, encoding="latin-1")
ratings.columns = ['userID', 'ISBN', 'Book-Rating']
ratings.head()

   userID        ISBN  Book-Rating
0  276725  034545104X            0
1  276726  0155061224            5
2  276727  0446520802            0
3  276729  052165615X            3
4  276729  0521795028            6

In [19]:
ratings['Book-Rating'].replace(ratings['Book-Rating']<5,np.NaN,inplace=True)

### Replace null values in column `Age` with mean

In [28]:
users['Age'].fillna(users['Age'].mean(),inplace=True)

### Change the datatype of `Age` to `int`

In [35]:
users['Age']=users['Age'].astype(int)
users['Age'].dtype

dtype('int32')

In [36]:
print(sorted(users.Age.unique()))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 113, 114, 115, 116, 118, 119, 123, 124, 127, 128, 132, 133, 136, 137, 138, 140, 141, 143, 146, 147, 148, 151, 152, 156, 157, 159, 162, 168, 172, 175, 183, 186, 189, 199, 200, 201, 204, 207, 208, 209, 210, 212, 219, 220, 223, 226, 228, 229, 230, 231, 237, 239, 244]

## Exploring the Ratings Dataset

### check the shape

In [37]:
ratings.shape

(1149780, 3)

In [38]:
n_users = users.shape[0]
n_books = books.shape[0]

In [39]:
ratings.head(5)

   userID        ISBN  Book-Rating
0  276725  034545104X            0
1  276726  0155061224            5
2  276727  0446520802            0
3  276729  052165615X            3
4  276729  0521795028            6

In [44]:
ratings.shape

(1031130, 3)

### Ratings dataset should have books only which exist in our books dataset. Drop the remaining rows

In [70]:
#ratings=ratings[ratings.ISBN.isin(books.ISBN).astype(int)]
#ratings.head()
#Df1.assign(InDf2=Df1.name.isin(Df2.IDs).astype(int))
#ratings[ratings.ISBN.isin(books)]

ratings.iloc[ratings.ISBN.isin(books)]

AttributeError: 'Series' object has no attribute 'ISBN'

In [47]:
books.shape

(271366, 5)

### Ratings dataset should have ratings from users which exist in users dataset. Drop the remaining rows

### Consider only ratings from 1-10 and leave 0s in column `bookRating`

### Find out which rating has been given highest number of times

### **Collaborative Filtering Based Recommendation Systems**

### For more accurate results only consider users who have rated atleast 100 books

### Generating ratings matrix from explicit ratings

#### Note: since NaNs cannot be handled by training algorithms, replace these by 0, which indicates absence of ratings

### Generate the predicted ratings using SVD with no.of singular values to be 50

### Take a particular user_id

### Lets find the recommendations for user with id `2110`

#### Note: Execute the below cells to get the variables loaded

In [ ]:
userID = 2110

In [ ]:
user_id = 2 #2nd row in ratings matrix and predicted matrix

### Get the predicted ratings for userID `2110` and sort them in descending order

### Create a dataframe with name `user_data` containing userID `2110` explicitly interacted books

In [ ]:
user_data.head()

In [ ]:
user_data.shape

### Combine the user_data and and corresponding book data(`book_data`) in a single dataframe with name `user_full_info`

In [ ]:
book_data.shape

In [ ]:
book_data.head()

In [ ]:
user_full_info.head()

### Get top 10 recommendations for above given userID from the books not already rated by that user